{
    "pages": [
        {
            "name": "about_you_page",
            "elements": [
             {
              "type": "radiogroup",
              "name": "aboutYou",
              "title": {
                  "default": "What best describes your relation to data?"
              },
              "isRequired": true,
              "choices": [
                  {
                      "value": 0,
                      "text": {
                          "default": "I gather or create data through program or service delivery."
                      }
                  },
                  {   "value": 1,
                      "text": {
                          "default": "I interpret trends and patterns in datasets, and communicate conclusions and recommendations to others."
                      }
                  },
                  {
                      "value": 4,
                      "text": {
                          "default": "I use advanced analytics (e.g., inferential statistics, algorithms, data mining) to develop solutions to business problems."
                      }
                  },
                  {
                      "value": 2,
                      "text": {
                          "default": "I make operational and strategic planning decisions based on data-derived insights."
                      }
                  },
                  {
                    "value": 3,
                    "text": {
                        "default": "I manage government data throughout its entire lifecycle." 
                    }
                },
                  {
                    "value": 5,
                    "text": {
                        "default": "I design, implement and maintain the architecture for datasets, databases and data warehouses."
                    }
                }
              ]
             }
            ],
            "title": {
                "default": "About You"
              }
           },
     {
      "name": "data_culture_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "dataCulture",
        "title": {
            "default": "What best describes your knowledge of how data is used your organization?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I am unsure how my organization or area collects, manages, or uses data."
                }
            },
            {   "value": 1,
                "text": {
                    "default": "I understand the workflow to collect, manage, analyze and apply data to solve business problems."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I understand the data management processes in my organization, from creation and initial storage to archiving and deletion."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I develop data management policies in my organization to promote the preservation, protection, access, re-use and shareability of government data assets."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Data Culture"
        }
     },
     {
      "name": "data_ethics_and_security_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "dataEthicsAndSecurity",
        "title": {
            "default": "What best describes your familiarity with data ethics and security?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I am unsure about guidelines on the responsible use and sharing of data."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I understand key elements about responsible use and sharing of data, like completing a PIAs. "
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I regularly identify ethics or security risks around data collection or usage, and establish controls to ensure data confidentiality, integrity, and security."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I have developed or overseen compliance with privacy protection policies and procedures."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Data Ethics and Security"
        }
     },
     {
      "name": "ask_questions_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "askQuestions",
        "title": {
            "default": "What best describes your ability to formulate research questions?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I am beginning to learn about the kinds of problems can be solved by using data."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I am able to formulate questions that can be answered with simple data queries."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I develop projects based on questions that need complex data queries and multiple iterations to resolve."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I regularly translate business needs into analytic or reporting requirements, including progress monitoring and performance evaluation."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Asking the Right Questions"
        }
     },
     {
      "name": "find_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "find",
        "title": {
            "default": "What best describes the data sources / strategies you use to find data?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I use search engines like Google to search for data."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I know a few data portals and public databases, and can choose the most relevant ones to help me with my work."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I use advanced methods and software to collect and combine data from multiple sources to solve business problems."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I know when the available data cannot solve a given problem, and can generate or obtain new data if needed."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Finding Data",
          "fr": "Recherche de données"
        }
     },
     {
      "name": "clean_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "clean",
        "title": {
            "default": "What best describes the strategies you use to clean data?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I did not know that data might need to be checked, cleaned or normalized. I use data as is."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I can identify common data quality issues (e.g. empty fields, duplicates) and manually fix invalid records and errors."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I always make sure that my data is clean, easy-to-access, and machine readable."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I can use automated scripts to detect duplication, fix invalid records, or address empty fields."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Cleaning Data"
      }
     },
     {
        "name": "manage_page",
        "elements": [
         {
          "type": "radiogroup",
          "name": "manage",
          "title": {
              "default":"What best describes the strategies you use to manage data?"
          },
          "isRequired": true,
          "choices": [
              {
                  "value": 0,
                  "text": {
                      "default": "I am beginning to learn about managing data sets."
                  }
              },
              {
                  "value": 1,
                  "text": {
                      "default": "I can collect, edit and store simple datasets in a spreadsheet, and or am familiar with the importance of documenting datasets using appropriate metadata descriptors like author, date created, access rights."
                  }
              },
              {
                  "value": 2,
                  "text": {
                      "default": "I can design, implement or manage large databases (e.g., big data, real-time dashboards) and I follow data management standards."
                  }
              },
              {
                  "value": 3,
                  "text": {
                      "default": "I can integrate collected data into information systems, set up data pipelines or improve the interoperability of data, and I can help creation or maintain data dictionaries."
                  }
              }
          ]
         }
        ],
        "title": {
            "default": "Managing Data"
          }
       },
     {
      "name": "analyze_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "analyze",
        "title": {
            "default": "What best describes how you analyze data?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I use basic summaries of data to read information."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I am familiar with common descriptive statistics to identify basic relationships, trends and patterns in data."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I can use advanced and inferential statistics to identify significant relationships, such as linear regressions and decision trees."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I can use predictive or machine learning techniques, such as clustering, forecasting, and natural language processing."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Analyze Data"
      }
     },
     {
      "name": "visualize_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "visualize",
        "title": {
            "default": "What best describes how you visualize data?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I am beginning to learn about data visualization techniques. I usually choose standard visualizations based on what looks best."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I can represent basic information in a table or graph (e.g., pie charts, bar graphs)."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I design interactive charts or dashboards using static data, and choose visualizations from a range of options (e.g., treemaps, ribbons)."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I design sophisticated visualizations that update automatically with real-time data."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Visualize Data"
      }
     },
     {
      "name": "communicate_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "communicate",
        "title": {
            "default": "What best describes how you communicate data outputs?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I am beginning to learn about how to communicate data findings, or how the data fits into a broader context."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I can develop basic reports or prepare simple visual summaries that illustrate and support the main data insights."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I can create complex reports that identify key takeaway points and make recommendations."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I can use data and visualizations to build a compelling narrative that is tailored to the audience "
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Communicating with Data"
      }
     },
     {
      "name": "assess_and_interpret_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "assessAndInterpret",
        "title": {
            "default": "What best describes your ability to critically assess and interpret data insights?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I take reports and visualizations at face value without questioning their accuracy and message."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I am aware that data needs to be critically assessed, but am not comfortable doing so myself."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I can critically assess the accuracy, assumptions, reliability and validity of data when presented as evidence (e.g., correlation is not causation)."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I have the knowledge needed to meaningfully interpret and translate data insights into action, new ideas, or innovative solutions."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Assessing & Interpreting Data Outputs"
      }
     }
    ],
    "showProgressBar": "bottom"
   }
