{
    "pages": [
        {
            "name": "about_you_page",
            "elements": [
             {
              "type": "radiogroup",
              "name": "aboutYou",
              "title": {
                  "default": "Which statement best describes your relation to data?"
              },
              "isRequired": true,
              "choices": [
                  {
                      "value": 0,
                      "text": {
                          "default": "I do consult and create data through delivering programs and services to citizens, businesses, not-for-profit organizations, academia or other levels of government."
                      }
                  },
                  {   "value": 1,
                      "text": {
                          "default": "I identify and interpret trends and patterns in datasets, and communicate conclusions and recommendations to decision makers and stakeholders."
                      }
                  },
                  {
                      "value": 4,
                      "text": {
                          "default": "I use advanced statistical, algorithmic, mining and visualization techniques for developing data solutions to business problems."
                      }
                  },
                  {
                      "value": 2,
                      "text": {
                          "default": "I make operational and strategic planning decisions based on analytical insights derived from data."
                      }
                  },
                  {
                    "value": 3,
                    "text": {
                        "default": "I oversee the management of government data throughout its entire lifecycle." 
                    }
                },
                  {
                    "value": 5,
                    "text": {
                        "default": "I design, implement and maintain the architecture needed to collect and analyze large datasets."
                    }
                }
              ]
             }
            ],
            "title": {
                "default": "About You"
              }
           },
     {
      "name": "data_culture_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "dataCulture",
        "title": {
            "default": "How would you describe your understanding of how data flows through your organization?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I am aware that my organization has data, but I am unsure how it is collected, managed and used to benefit British Columbians."
                }
            },
            {   "value": 1,
                "text": {
                    "default": "I have a general understanding of the workflow to acquire, process and analyze data to solve business problems."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I have a detailed understanding of all stages of the data lifecycle, from creation and initial storage to the time it is archived or become obsolete and is deleted."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I develop data lifecycle management policies and processes to promote the preservation, protection, access, re-use and shareability of government data assets."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Data Culture"
        }
     },
     {
      "name": "data_ethics_and_security_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "dataEthicsAndSecurity",
        "title": {
            "default": "Which statement best describes your familiarity with data ethics and security?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I am not aware of any specific guidelines that ensure a responsible use and sharing of data."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I once completed a Privacy Impact Assessment (PIA) to make sure the information I collect or use in my project is protected."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I identify risks whenever I collect or use data, and robust privacy controls are established to ensure the confidentiality, integrity and security of data throughout its lifecycle."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I have experience in developing and overseeing compliance with privacy protection policies and procedures."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Data Ethics and Security"
        }
     },
     {
      "name": "ask_questions_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "askQuestions",
        "title": {
            "default": "How would you describe your ability to formulate questions to get meaningful insights from data?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I have no idea what kind of problems can be solved with the use of data."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I am able to formulate questions that can be answered with simple data queries."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I develop projects based on questions that need complex data queries and multiple iterations to resolve."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I regularly translate business needs into analytic or reporting requirements to support program, project or policy goals, including monitoring progress and evaluating performance."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Asking the Right Questions"
        }
     },
     {
      "name": "find_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "find",
        "title": {
            "default": "Which data sources / strategies do you use in order to find data?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I use basic search engines like Google to try to find data."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I know a few data portals and public databases, and can choose the most relevant ones to help me with my work."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I use advanced methods and software to collect and combine data from multiple sources to solve business problems."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I can detect when a given problem or need cannot be solved with the existing data, and know how to deploy research techniques to obtain new data."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Finding Data",
          "fr": "Recherche de données"
        }
     },
     {
      "name": "clean_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "clean",
        "title": {
            "default": "Which strategies do you use to clean your data?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I did not know that data might have to be checked, cleaned or normalized. I use data as is."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I know that data is not perfect. I am aware of common data quality issues (e.g. empty fields, duplicates) and can manually fix errors."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": " I am very aware of data quality criteria (e.g. machine processable, empty fields, duplicate detection). I detect and remove invalid records using programs that support data cleaning."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I am able to remove invalid records and translate all the columns to use a same set of values through an automated script. I often combine different datasets into a single table, remove duplicate entries or apply any number of other normalizations."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Cleaning Data"
      }
     },
     {
        "name": "manage_page",
        "elements": [
         {
          "type": "radiogroup",
          "name": "manage",
          "title": {
              "default":"Which strategies do you use in order to manage data?"
          },
          "isRequired": true,
          "choices": [
              {
                  "value": 0,
                  "text": {
                      "default": "I did not realize that data had to be managed to support the integrity, security and accessibility of the data."
                  }
              },
              {
                  "value": 1,
                  "text": {
                      "default": "I can collect, edit and store simple datasets in a spreadsheet. I am aware of the importance of creating appropriate metadata descriptors (e.g. author, date created, access rights) to fully document the data set."
                  }
              },
              {
                  "value": 2,
                  "text": {
                      "default": "I am able to design, implement and manage large databases, including big data environments and real-time dashboards. I follow data standards that are implemented across the organizations."
                  }
              },
              {
                  "value": 3,
                  "text": {
                      "default": "I integrate collected data with existing information systems, setting up data pipelines and improving the interoperability of data. I support the creation and maintenance of data dictionaries to document corporate datasets."
                  }
              }
          ]
         }
        ],
        "title": {
            "default": "Managing Data"
          }
       },
     {
      "name": "analyze_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "analyze",
        "title": {
            "default": "How do you analyze your data?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I simply use basic summaries of data to read information."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I work with basic descriptive statistics to identify basic relationships, trends and patterns in data. I often use bar and pie charts."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I can work with advanced statistics and create inferential views of data, linear regressions and decision trees."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I am able to use modern statistical software to perform various machine learning techniques, such as clustering, forecasting, and natural language processing."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Analyze Data"
      }
     },
     {
      "name": "visualize_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "visualize",
        "title": {
            "default": "Which strategy do you use to visualize your data?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I don’t know how to present data. I choose standard visualizations based on what looks best."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I visualize specific information that can easily be represented in a table or graph (e.g. 2 variable using Excel)."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I design interactive charts or dashboards using advanced visual analytics tools. I can choose the visualization that best fits my target audience and data story."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I can create sophisticated visualizations that update automatically with real-time data and anticipate users needs."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Visualize Data"
      }
     },
     {
      "name": "communicate_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "communicate",
        "title": {
            "default": "How do you communicate your data outputs?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I do not know how to communicate my data findings or how to put them into a broader context."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I am able to develop reports and prepare static visual summaries illustrating and supporting data insights."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I use common presentation tools to present key takeaway points and make recommendations."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I build a compelling narrative around a set of data and visualizations to communicate key insights to decision-makers and stakeholders."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Communicating with Data"
      }
     },
     {
      "name": "assess_and_interpret_page",
      "elements": [
       {
        "type": "radiogroup",
        "name": "assessAndInterpret",
        "title": {
            "default": "How would you describe your ability to assess and interpret data insights?"
        },
        "isRequired": true,
        "choices": [
            {
                "value": 0,
                "text": {
                    "default": "I take reports and visualizations at face value without questioning their correctness and message."
                }
            },
            {
                "value": 1,
                "text": {
                    "default": "I know I need to critically assess the accuracy, assumptions, reliability and validity of data when presented as evidence. For example, I am aware that correlation is not causation."
                }
            },
            {
                "value": 2,
                "text": {
                    "default": "I consistently question and challenge data outputs and results. I can interpet and translate insights into actionable knowledge."
                }
            },
            {
                "value": 3,
                "text": {
                    "default": "I use data to generate new ideas and innovative solutions to real world problems."
                }
            }
        ]
       }
      ],
      "title": {
          "default": "Assessing & Interpreting Data Outputs"
      }
     }
    ],
    "showProgressBar": "bottom"
   }
